// 문제
// 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.

// 1+1+1+1
// 1+1+2
// 1+2+1
// 2+1+1
// 2+2
// 1+3
// 3+1
// 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

// 입력
// 첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 한 줄로 이루어져 있고, 정수 n이 주어진다. n은 양수이며 11보다 작다.

// 출력
// 각 테스트 케이스마다, n을 1, 2, 3의 합으로 나타내는 방법의 수를 출력한다.

#include <stdio.h>

// n의 경우의 수 저장
int n_list[11];

// 메인 함수
int main(void) {
    int T, n; // 테스트 케이스의 개수, 정수 n
    
    // n_list의 기본 설정 (3까지)
    n_list[1] = 1;
    n_list[2] = 2;
    n_list[3] = 4;

    // 나머지 n의 개수 구하기
    for(int i = 4; i < 11; i++) {
        n_list[i] = n_list[i-1] + n_list[i-2] + n_list[i-3];
    }

    // 기본 설정
    scanf("%d" ,&T);
    
    // 출력
    for(int i = 0; i < T; i++) {
        scanf("%d" ,&n);
        printf("%d\n" ,n_list[n]);
    }

    return 0;
}